##################################
#encoding=utf8                   #
#version =py27, py33             #
#author  =sanhe                  #
#date    =2014-11-01             #
#                                #
#    (\ (\                       #
#    ( -.-)o    I am a Rabbit!   #
#    o_(")(")                    #
#                                #
##################################

"""位运算符
"""

from __future__ import print_function

print(3&1) # 位与 11 & 01 = 01
print(3|1) # 位或 11 | 01 = 11
print(~3)  # 位反 ~10000011 = 01111100 任何数的反码等于加负号-1
print(3^1) # 位异或 11 ^ 01 = 10
print(~3^1) # 位同或 11 ~^ 01 = 01

print(1<<2) # 对于左移运算，就是将一个数的二进制位整体向左移若干位，移位后在低位补零，高位溢出部分舍弃。
print(4>>2) # 对于右移运算，就是将一个数的二进制位整体向右移若干位。
            # 如果该数为正数，移位后的低位溢出部丢弃，高位补零；
            # 如果该数为负数，则移位后的低位溢出部丢弃，高位补1，以保持符号不变。
            # 实际上，将一个数右移几位，就相当于将这个数除以2的几次幂。